In [31]:
import pandas as pd
import sqlite3

#### Table 1 with age name id

In [32]:

new= sqlite3.connect('students.db')  
c=new.cursor()
query=""" select * from student """
output = c.execute(query).fetchall()
print(output)

[(1, 'Alice', 19), (2, 'Bob', 20), (3, 'Tej', 20), (4, 'Mike', 22), (5, 'tejas', 19), (6, 'Nishant', 28), (7, 'Ved', 24), (8, 'Rohan', 29), (10, 'Ayush', 25), (11, 'Manish', 19)]

In [33]:
c.execute("SELECT * FROM student")
output = c.fetchall()
df1 = pd.DataFrame(output, columns=['id', 'name', 'age'])
df1

   id     name  age
0   1    Alice   19
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   5    tejas   19
5   6  Nishant   28
6   7      Ved   24
7   8    Rohan   29
8  10    Ayush   25
9  11   Manish   19

#### Table 2 with id and college_name

In [ ]:
query="""
Create Table students_data (
    id INTEGER PRIMARY KEY,
    college_name TEXT NOT NULL)"""
c.execute(query)
output = c.fetchall()
print(output)

In [ ]:
stud_data = [
    {"id": 1, "college_name": "MIT"},
    {"id": 2, "college_name": "Stanford"},
    {"id": 3, "college_name": "Harvard"},
    {"id": 4, "college_name": "Yale"},
    {"id": 5, "college_name": "Princeton"},
    {"id": 6, "college_name": "Columbia"},
    {"id": 7, "college_name": "Caltech"},
    {"id": 8, "college_name": "UCLA"},
    {"id": 9, "college_name": "Berkeley"},
    {"id": 10, "college_name": "Cornell"},
    {"id": 11, "college_name": "University of Chicago"},
    {"id": 12, "college_name": "Johns Hopkins University"},
    {"id": 13, "college_name": "Duke University"},
    {"id": 14, "college_name": "Northwestern University"},
    {"id": 15, "college_name": "University of Michigan"}]

query = """INSERT INTO students_data Values (:id, :college_name)
;"""
c.executemany(query, stud_data)
new.commit()

In [35]:
c.execute("SELECT * FROM students_data")
output = c.fetchall()
df2 = pd.DataFrame(output, columns=['id','college_name'])
df2

    id              college_name
0    1                       MIT
1    2                  Stanford
2    3                   Harvard
3    4                      Yale
4    5                 Princeton
5    6                  Columbia
6    7                   Caltech
7    8                      UCLA
8    9                  Berkeley
9   10                   Cornell
10  11     University of Chicago
11  12  Johns Hopkins University
12  13           Duke University
13  14   Northwestern University
14  15    University of Michigan

#### Left join

In [36]:
c.execute("SELECT name FROM sqlite_master WHERE type='table'")
print(c.fetchall())

[('student',), ('students_data',)]

In [51]:
query = """
SELECT s.id, s.name, s.age, sd.college_name
FROM student s
LEFT JOIN students_data sd ON s.id = sd.id
"""
c.execute(query)
df_left = pd.DataFrame(c.fetchall(), columns=['id', 'name', 'age', 'college_name'])
print(df_left)

   id     name  age           college_name
0   1    Alice   19                    MIT
1   2      Bob   20               Stanford
2   3      Tej   20                Harvard
3   4     Mike   22                   Yale
4   5    tejas   19              Princeton
5   6  Nishant   28               Columbia
6   7      Ved   24                Caltech
7   8    Rohan   29                   UCLA
8  10    Ayush   25                Cornell
9  11   Manish   19  University of Chicago

#### FULL Join

In [53]:
query = """select * from student s
FULL JOIN students_data sd
on s.id = sd.id"""
c.execute(query)
full = pd.DataFrame(c.fetchall(), columns=['ID','name','age' ,'student_id', 'college_name'])
print(full)

      ID     name   age  student_id              college_name
0    1.0    Alice  19.0           1                       MIT
1    2.0      Bob  20.0           2                  Stanford
2    3.0      Tej  20.0           3                   Harvard
3    4.0     Mike  22.0           4                      Yale
4    5.0    tejas  19.0           5                 Princeton
5    6.0  Nishant  28.0           6                  Columbia
6    7.0      Ved  24.0           7                   Caltech
7    8.0    Rohan  29.0           8                      UCLA
8   10.0    Ayush  25.0          10                   Cornell
9   11.0   Manish  19.0          11     University of Chicago
10   NaN     None   NaN           9                  Berkeley
11   NaN     None   NaN          12  Johns Hopkins University
12   NaN     None   NaN          13           Duke University
13   NaN     None   NaN          14   Northwestern University
14   NaN     None   NaN          15    University of Michigan

#### CROSS join

In [49]:
query =""" select * from student s
cross join students_data sd
"""
c.execute(query)
cross = pd.DataFrame(c.fetchall(), columns=['ID','name','age' ,'student_id', 'college_name'])
cross

     ID    name  age  student_id              college_name
0     1   Alice   19           1                       MIT
1     1   Alice   19           2                  Stanford
2     1   Alice   19           3                   Harvard
3     1   Alice   19           4                      Yale
4     1   Alice   19           5                 Princeton
..   ..     ...  ...         ...                       ...
145  11  Manish   19          11     University of Chicago
146  11  Manish   19          12  Johns Hopkins University
147  11  Manish   19          13           Duke University
148  11  Manish   19          14   Northwestern University
149  11  Manish   19          15    University of Michigan

[150 rows x 5 columns]

In [40]:
read_sql_query = "SELECT * FROM student"
print(pd.read_sql_query(read_sql_query, new))

   id     name  age
0   1    Alice   19
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   5    tejas   19
5   6  Nishant   28
6   7      Ved   24
7   8    Rohan   29
8  10    Ayush   25
9  11   Manish   19

In [ ]:
read_sql_query="insert into student values (11,'Manish',19)"
c.execute(read_sql_query)
new.commit()
read_sql_query="select * from student"
print(pd.read_sql_query(read_sql_query, new))

In [ ]:
read_sql_query="update student set age =19 where id in(1,14)"
c.execute(read_sql_query)
new.commit()
read_sql_query="select * from student"
print(pd.read_sql_query(read_sql_query, new))

   id     name  age
0   1    Alice   19
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   6  Nishant   28
5   7      Ved   24
6   8    Rohan   29
7  10    Ayush   25
8  11   Manish   19
9  14    tejas   19

In [ ]:
read_sql_query="update student set id =5 where name = 'tejas'"
c.execute(read_sql_query)
new.commit()
read_sql_query="select * from student"
print(pd.read_sql_query(read_sql_query, new))

   id     name  age
0   1    Alice   19
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   5    tejas   19
5   6  Nishant   28
6   7      Ved   24
7   8    Rohan   29
8  10    Ayush   25
9  11   Manish   19

In [43]:
read_sql_query = "select * from student"
c.execute(read_sql_query)
print(pd.read_sql_query(read_sql_query, new))

   id     name  age
0   1    Alice   19
1   2      Bob   20
2   3      Tej   20
3   4     Mike   22
4   5    tejas   19
5   6  Nishant   28
6   7      Ved   24
7   8    Rohan   29
8  10    Ayush   25
9  11   Manish   19


---

#### 1. **INNER JOIN** – *"Only what's common"*

**Real-life use:**
In a school, you want to list only **students who have registered for a course**.

**Why it's useful:**
You only want meaningful matches — no extra or missing data. It keeps your report clean and focused.

**Example Scenario:**
You run a report of students *actually attending* classes — no empty or orphaned data.

>  Used when: Only relevant, matched data matters (e.g., active orders with customers, enrolled students with courses).

---

####  2. **LEFT JOIN** – *"Everything from left, add matching info from right"*

**Real-life use:**
You want to see **all students**, even if some haven’t enrolled in a course yet.

**Why it's useful:**
It helps spot missing data or incomplete processes — e.g., who hasn’t registered for classes.

**Example Scenario:**
The admin wants to remind students who haven’t registered yet.

> Used when: You must include everything from one side, and optionally match from the other (e.g., customers with or without orders).

---

#### 3. **FULL OUTER JOIN** – *"Everthing from both sides, and only shows the matched part and nan where not matched"*

**Real-life use:**
You want to see **all students** and **all course enrollments**, including:

* Students who didn’t enroll
* Courses assigned to non-existent students

**Why it's useful:**
It gives a complete picture — helps in **data auditing**, validation, and fixing inconsistencies.

**Example Scenario:**
The system shows missing students for some course entries or new students who aren't in course records.

>  Used when: You need the **whole picture**, for cleanup, reconciliation, or audits.

---

####  4. **CROSS JOIN** – *"All possible combinations"*

**Real-life use:**
You’re scheduling interviews between **5 candidates and 3 interviewers**, and want to see every possible pair.

**Why it's useful:**
It helps in **planning scenarios**, like generating all possible combinations of items, time slots, or teams.

**Example Scenario:**
In an event, list every student with every session to assign them later.

>Used when: You want to **generate combinations** or permutations (e.g., test all prices × features, students × time slots).